Repository: banool/slsl_dictionary
Catalog: frontend/lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: SLSL Dictionary
si: ශ්‍රී ලංකා සංඥා භාෂා ශබ්දකෝෂය
ta: இலங்கை சைகை மொழி அகராதி

# newsTitle
source: News
si: පුවත්
ta: செய்தி

# searchTitle
source: Search
si: සොයන්න
ta: தேடல்

# listsTitle
source: Lists
si: ලැයිස්තු
ta: பட்டியல்கள்

# revisionTitle
source: Revision
si: සංශෝධනය
ta: திருத்தம்

# settingsTitle
source: Settings
si: සැකසුම්
ta: அமைப்புகள்

# searchHintText
source: Search for a word
si: වචනයක් සොයන්න
ta: ஒரு வார்த்தையை கண்டுபிடி

# flashcardsRevisionSources
source: Revision Sources
si: සංශෝධන මූලාශ්‍ර
ta: திருத்த ஆதாரங்கள்

# flashcardsSelectListsToRevise
source: Select lists to revise
si: සංශෝධනය කිරීමට ලැයිස්තු තෝරන්න
ta: மாற்றியமைக்க பட்டியல்களைத் தேர்ந்தெடுக்கவும்

# flashcardsSelectLists
source: Select Lists
si: ලැයිස්තු තෝරන්න
ta: பட்டியலைத் தேர்ந்தெடு

# flashcardsTypes
source: Flashcard Types
si: ෆ්ලෑෂ්කාඩ් වර්ග
ta: ஃபிளாஷ் கார்டுகளின் வகைகள்

# flashcardsSignToWord
source: Sign -> Word
si: සංඥා -> වචනය
ta: கையெழுத்து -> சொல்

# flashcardsWordToSign
source: Word -> Sign
si: වචනය -> සංඥා
ta: சொல் -> அl;டையாளம்

# flashcardsRevisionSettings
source: Revision Settings
si: සංශෝධන සැකසුම්
ta: மீள்திருத்த அமைப்புகள்

# flashcardsSelectRevisionStrategy
source: Select revision strategy
si: සංශෝධන ක්‍රමය තෝරන්න
ta: மீள்திருத்த முறையைத் தேர்ந்தெடு

# flashcardsStrategy
source: Strategy
si: උපාය මාර්ගය
ta: மூலோபாயம்

# flashcardsSelectSignRegions
source: Select sign regions
si: සංඥා කලාප තෝරන්න
ta: சிக்னல் மண்டலங்களைத் தேர்ந்தெடு

# flashcardsRegions
source: Regions
si: කළාප
ta: பிராந்தியங்கள்

# flashcardsStart
source: Start
si: ආරම්භ කරන්න
ta: தொடங்கு

# flashcardsOnlyOneCard
source: Show only one set of cards per word
si: වචනයකට කාඩ් කට්ටලයක් පමණින් පෙන්වන්න
ta: ஒரு வார்த்தைக்கு ஒரு செட் கார்டுகளை மட்டும் காட்டு

# flashcardsRevisionLanguage
source: Revision Language
si: සංශෝධන භාෂාව
ta: திருத்த மொழி

# flashcardsAllOfSriLanka
source: All of Sri Lanka
si: මුළු ලංකාවම
ta: முழு இலங்கையும்

# flashcardsNorthEast
source: North East
si: උතුරු නැගෙනහිර
ta: வட கிழக்கு

# flashcardsNext
source: Next
si: මීළඟ
ta: அடுத்தது

# flashcardsForgot
source: Forgot
si: අමතක වුනා
ta: மறந்துவிட்டேன்

# flashcardsGotIt
source: Got it!
si: සොයා ගත්තා!
ta: கண்டறியப்பட்டது!

# flashcardsWhatIsSignForWord
source: What is the sign for this word?
si: මෙම වචනය සඳහා සංඥා භාෂාව කුමක්ද?
ta: இந்த வார்த்தைக்கான சைகை மொழி என்ன?

# flashcardsWhatDoesSignMean
source: What does this sign mean?
si: මෙම සංඥාවේ අර්ථයකුමද?
ta: இந்த சிக்னல் எதையாவது குறிக்கிறதா?

# flashcardsOpenDictionaryEntry
source: Open dictionary entry
si: ශබ්දකෝෂය වචන මාලාව විවෘත කරන්න
ta: திறந்த அகராதி சொல்லகராதி

# flashcardsSuccessRate
source: Success Rate
si: සාර්ථකත්ව අනුපාතය
ta: வெற்றி விகிதம்

# flashcardsTotalCards
source: Total Cards
si: සම්පූර්ණ කාඩ්
ta: முழு அட்டை

# flashcardsSuccessfulCards
source: Successful Cards
si: සාර්ථක කාඩ්
ta: வெற்றி அட்டை

# flashcardsIncorrectCards
source: Incorrect Cards
si: වැරදි කාඩ්
ta: தவறான அட்டை

# flashcardsTotalReviews
source: Total Reviews
si: මුළු සමාලෝචන
ta: மொத்த மதிப்புரைகள்

# flashcardsUnsuccessfulCards
source: Unsuccessful Cards
si: අසාර්ථක කාඩ්
ta: ஃபெயில் கார்டு

# flashcardsUniqueWords
source: Unique Words
si: අනන්‍ය වචන
ta: தனித்துவமான வார்த்தைகள்

# flashcardsLongestStreak
source: Longest Streak
si: දිගම ක්‍රියාවලිය
ta: நீண்ட செயல்முறை

# flashcardsStatsCollectedSince
source: Stats collected since
si: සංඛ්‍යාන දැනට ඇතුලත් කර ඇත
ta: தற்போது உள்ளிடப்பட்டுள்ள புள்ளி விவரங்கள்

# flashcardsRevisionSummaryTitle
source: Revision Summary
si: සංශෝධන සාරාංශය
ta: திருத்தச் சுருக்கம்

# flashcardsRevisionProgressTitle
source: Revision Progress
si: සංශෝධන ප්‍රගතිය
ta: திருத்த முன்னேற்றம்

# flashcardsRevisionStategyToShow
source: Revision strategy to show stats for
si: සංඛ්‍යාලේඛන පෙන්වීමට සඳහා සංශෝධන උපාය මාර්ගය පෙන්වන්න
ta: புள்ளிவிவரங்களைக் காட்ட திருத்த உத்தியைக் காட்டு

source: Set playback speed to
si: ප්‍රතිවාදන වේගය සකසන්න
ta: பிளேபேக் வேகத்தை அமைக்கவும்

# settingsPlayStoreFeedback
source: Give feedback on Play Store
si: Play Store ප්‍රතිචාරය දෙන්න
ta: Play Store கருத்துகளை வழங்கவும்

# settingsAppStoreFeedback
source: Give feedback on App Store
si: App Store ප්‍රතිචාරය දෙන්න
ta: App Store கருத்தை வழங்கவும்

source: N/A
si: නොදනී

# settingsLanguage
source: Language
si: භාෂාව
ta: மொழி

# settingsRevision
source: Revision
si: සංශෝධන
ta: திருத்தம்

# settingsHideRevision
source: Hide revision feature
si: සංශෝධන විශේෂාංග සඟවන්න
ta: எடிட்டிங் அம்சங்களை மறை

# settingsDeleteRevisionProgress
source: Delete all revision progress
si: සියලුම සංශෝධන ප්‍රගතිය මකන්න
ta: அனைத்து மீள்திருத்த முன்னேற்றத்தையும் நீக்கு

# settingsDeleteRevisionProgressExplanation
source: This will delete all your review progress from all time for both the spaced repetition and random review strategies. Your lists (including favourites) will not be affected. Are you 100% sure you want to do this?
si: මෙය මගින් ඔබගේ සියලුම සමාලෝචන, ප්‍රගතිය මාකාදමයි. (ඔබගේ ලැයිස්තු ප්‍රියතමයන් බලපාන්නේ නැත.) ඔබට මෙය කිරීමට අවශ්‍ය බව 100% විශ්වාසද?
ta: இது உங்கள் எல்லா மதிப்புரைகளையும், முன்னேற்றத்தையும் நீக்கும். (உங்கள் பட்டியலில் பிடித்தவை பாதிக்கப்படாது.) இதை 100% உறுதியாகச் செய்ய விரும்புகிறீர்களா?

# settingsProgressDeleted
source: All review progress deleted
si: සියලුම සමාලෝචන ප්‍රගතිය මකාදමා ඇත
ta: அனைத்து மதிப்பாய்வு முன்னேற்றமும் நீக்கப்பட்டது

# settingsCache
source: Cache
si: තාවකාලික මතකයන්
ta: தற்காலிக நினைவுகள்

# settingsCacheVideos
source: Cache videos
si: වීඩියෝ තාවකාලික මතකයන් කරන්න
ta: வீடியோ நினைவுகளை உருவாக்கு

# settingsDropCache
source: Drop cache
si: තාවකාලික මතකයන් ඉවත් කරන්න
ta: தற்காலிக நினைவுகளை அழிக்கவும்

# settingsCacheDropped
source: Cache dropped
si: තාවකාලික මතකයන් ඉවත් කළ ඇත
ta: தற்காலிக நினைவுகள் அழிக்கப்பட்டன

# settingsData
source: Data
si: දත්ත
ta: தகவல்கள்

# settingsCheckNewData
source: Check for new dictionary data
si: නව ශබ්දකෝෂ දත්ත සඳහා පරීක්ෂා කරන්න
ta: புதிய அகராதித் தரவைச் சரிபார்க்கவும்

# settingsDataUpdated
source: Successfully updated dictionary data
si: ශබ්දකෝෂ දත්ත සාර්ථකව යාවත්කාලීන කළ ඇත
ta: அகராதி தரவு வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# settingsDataUpToDate
source: Data is already up to date
si: දත්ත දැනටමත් යාවත්කාලීන වී ඇත
ta: தரவு ஏற்கனவே புதுப்பிக்கப்பட்டது

# settingsLegal
source: Legal
si: නීතිය
ta: சட்டம்

# settingsSeeLegal
source: See legal information
si: නීතික තොරතුරු බලන්න
ta: சட்டத் தகவலைக் காண்க

# settingsBackgroundLogs
source: Background logs
si: පසුබිම් ලොග
ta: பின்னணி பதிவுகள்

# settingsHelp
source: Help
si: උපකාරය
ta: உதவி

# settingsReportDictionaryDataIssue
source: Report issue with dictionary data
si: ශබ්දකෝෂ දත්ත ගැටළුව වාර්තා කරන්න
ta: அகராதி தரவில் சிக்கலைப் புகாரளிக்கவும்

# settingsReportAppIssueGithub
source: Report issue with app (GitHub)
si: යෙදුමේ ගැටළුව (Github) වාර්තා කරන්න
ta: பயன்பாட்டுச் சிக்கலைப் புகாரளிக்கவும் (Github)

# settingsReportAppIssueEmail
source: Report issue with app (Email)
si: යෙදුමේ ගැටළුව (Email) වාර්තා කරන්න
ta: பயன்பாட்டுச் சிக்கலைப் புகாரளிக்கவும் (மின்னஞ்சல்)

# listFavourites
source: Favourites
si: ප්‍රියතම
ta: பிடித்த

source: List name cannot be empty
si: ලැයිස්තු නම හිස් විය නොහැක
ta: பட்டியல் பெயர் காலியாக இருக்க முடியாது

# listNameInvalid
source: Invalid name, this should have been caught already
si: වලංගු නොවන නම, මෙය දැනටමත් අල්ලාගෙන තිබිය යුතුය
ta: தவறான பெயர், இது ஏற்கனவே எடுக்கப்பட்டிருக்க வேண்டும்

# listEnterNewName
source: Enter new list name
si: නව නම ලැයිස්තු ඇතුළත් කරන්න
ta: புதிய பெயர் பட்டியலைச் செருகு

# listFailedToMake
source: Failed to make new list
si: නව ලැයිස්තුව සාදා ගැනීමට අසාර්ථක විය
ta: புதிய பட்டியலை உருவாக்க முடியவில்லை

# listNewList
source: New List
si: නව ලැයිස්තු
ta: புதிய பட்டியல்கள்

# listSearchAdd
source: Search for words to add
si: එක් කිරීම සඳහා වචන සොයන්න
ta: சேர்க்க வார்த்தைகளைக் கண்டுபிடி

# listSearchPrefix
source: Search
si: සොයන්න
ta: தேடல்

# wordAlreadyFavourited
source: Already favourited!
si: දැනටමත් ප්‍රියතම!
ta: ஏற்கனவே பிடித்தது!

# wordFavouriteThisWord
source: Favourite this word
si: මෙම වචනය ප්‍රියතම කරන්න
ta: இந்த வார்த்தை பிடித்தது

# wordNoDefinitions
source: No definitions data available for this word / phrase
si: මෙම වචනය / වාක්‍ය ඛණ්ඩය සඳහා නිර්වචන දත්ත නොමැත
ta: இந்த வார்த்தை/சொற்றொடருக்கு வரையறை தரவு எதுவும் இல்லை

# wordDataMissing
source: Data missing
si: දත්ත අතුරුදහන්
ta: காணாமல் தரவு

# entryTypeWords
source: Words
si: වචන
ta: சொற்கள்

# entryTypePhrases
source: Phrases
si: වාක්ය ඛණ්ඩ
ta: வாக்கியங்கள்

# entryTypeFingerspelling
source: Fingerspelling
si: ඇඟිලි කථාව
ta: விரல் பேச்சு

# entrySelectEntryTypes
source: Select Entry Types
si: ඇතුල්වීමේ වර්ග තෝරන්න
ta: நுழைவு வகைகளைத் தேர்ந்தெடு

source: Related words
si: අදාළ වචන
ta: சம்பந்தமான வார்த்தைகள்

# startupFailureMessage
source: Failed to start the app correctly. First, please confirm you are using the latest version of the app. If you are, please email daniel@dport.me with a screenshot showing this error.
si: යෙදුම නිවැරදිව ආරම්භ කිරීමට අසමත් විය. කරුණාකර, පළමුව, ඔබ යෙදුමේ නවතම අනුවාදය භාවිතා කරන බව සහතික කරන්න. ඔබ එසේ නම්, කරුණාකර මෙම දෝෂය පෙන්වන පුනරුපුවරුවක් සමග daniel@dport.me වෙත ඊමේල් කරන්න.
ta: பயன்பாடு சரியாகத் தொடங்குவதில் தோல்வி. தயவுசெய்து, முதலில், நீங்கள் பயன்பாட்டின் சமீபத்திய பதிப்பைப் பயன்படுத்துகிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். நீங்கள் இருந்தால், இந்தப் பிழையின் நகலுடன் daniel@dport.me ஐ மின்னஞ்சல் செய்யவும்.

# unexpectedErrorLoadingVideo
source: Unexpected error loading
si: අනපේක්ෂිත දෝෂය පූරණය කරමින්
ta: எதிர்பாராத பிழை ஏற்றுதல்

source: Device Default
si: ප්‍රදාන උපාංග
ta: சாதனங்களை வழங்கு
